<?php
// 3.经典面试题
$a = 10;
$b = 10;
// if ($a = 20 && $b = 30) {
//     $a++;
//     $b++;
// }
// echo $a, ' ', $b;

// $a                         = 20 && $b                         = 30为一个赋值表达式
// 20转化为bool为true, $b = 30为true;
// $a赋值为true
// 执行if语句,
// $a++为true++, bool不执行自增, 所以还为true
//  $b++为31,
// 输出, $a, true转化为数字1
//      $b为31;

// 4.
//
($a = 100) && ($b = 100);
var_dump(($a = 100) && ($b = 100));
echo $a, ' ', $b, '<hr>';
// 表达式结果为true,$a=100,$b=100

($a = 100) || ($b = 100);
var_dump(($a = 100) || ($b = 100));
echo $a, ' ', $b, '<hr>';
// 表达式结果为true,$a=100,$b=10

(!$a = 100) && ($b = 100);
var_dump((!$a = 100) && ($b = 100));
echo $a, ' ', $b, '<hr>';
// 表达式结果为false, $a = 100, $b=10

!($a = 100) && ($b = 100);
var_dump(!($a = 100) && ($b = 100));
echo $a, ' ', $b, '<hr>';
// 表达式结果为false, $a = 100, $b=10

// 表达式的结果是true,还是false,echo $a $b,输出结果是多少
